In [68]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [69]:
training_dataset = pd.read_csv('Titanic training dataset.csv' , delimiter = ',')
testing_dataset = pd.read_csv('Titanic testing dataset.csv' , delimiter = ',')

In [70]:
training_dataset

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.0000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
663,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,S,1
664,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,372622,7.7500,NaN,Q,0
665,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,S,1
666,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,NaN,S,0
667,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,Q,1

In [72]:
train_df = trainging_dataset.drop(['Name' ,'Ticket' , 'Cabin'] , axis =1)
test_df = testing_dataset.drop(['Name' ,'Ticket' , 'Cabin'] , axis =1)

In [73]:
combine = [train_df , test_df]
train_df.shape , test_df.shape

((668, 8), (223, 7))

In [74]:
train_df.head()

   Pclass     Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.0      1      0  26.000        S         1
1       3    male   NaN      0      0   8.050        S         0
2       2    male  39.0      0      0  26.000        S         0
3       3  female  29.0      0      4  21.075        S         0
4       3    male  25.0      0      0   7.050        S         0

In [75]:
for dataset in combine:
    dataset['Sex'] = dataset['Sex'].map( {'female': 1, 'male': 0} )

train_df.head()

   Pclass  Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2    1  29.0      1      0  26.000        S         1
1       3    0   NaN      0      0   8.050        S         0
2       2    0  39.0      0      0  26.000        S         0
3       3    1  29.0      0      4  21.075        S         0
4       3    0  25.0      0      0   7.050        S         0

In [76]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].fillna(freq_port)

In [77]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

train_df.head()

   Pclass  Sex   Age  SibSp  Parch    Fare  Embarked  Survived
0       2    1  29.0      1      0  26.000         0         1
1       3    0   NaN      0      0   8.050         0         0
2       2    0  39.0      0      0  26.000         0         0
3       3    1  29.0      0      4  21.075         0         0
4       3    0  25.0      0      0   7.050         0         0

In [78]:
test_df['Fare'].fillna(test_df['Fare'].dropna().mean(), inplace=True)
test_df.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       2    0   8.0      1      1  36.7500         0
1       1    1  49.0      0      0  25.9292         0
2       3    0   NaN      0      0   7.7375         2
3       2    1  24.0      2      1  27.0000         0
4       1    0  36.0      0      0  26.2875         0

In [79]:
test_df['Age'].fillna(test_df['Age'].dropna().mean(), inplace=True)
test_df.head()
train_df['Age'].fillna(train_df['Age'].dropna().mean(), inplace=True)
test_df.head()

   Pclass  Sex        Age  SibSp  Parch     Fare  Embarked
0       2    0   8.000000      1      1  36.7500         0
1       1    1  49.000000      0      0  25.9292         0
2       3    0  29.694775      0      0   7.7375         2
3       2    1  24.000000      2      1  27.0000         0
4       1    0  36.000000      0      0  26.2875         0

In [82]:
train_df.shape , test_df.shape

((668, 8), (223, 7))

In [86]:
X_train = train_df.drop('Survived' , axis= 1)
Y_train  = train_df['Survived']
X_test = test_df

In [92]:
X_train.shape , Y_train.shape , X_test.shape

((668, 7), (668,), (223, 7))

In [103]:
train_data = X_train.values
test_data = Y_train.values
train_data.shape , test_data.shape

((668, 7), (668,))

In [104]:
T_train , T_test , S_train , S_test = train_test_split(train_data , test_data)

In [105]:
lr = LogisticRegression(solver = 'liblinear')
lr.fit(X_train , Y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='liblinear', tol=0.0001, verbose=0,
                   warm_start=False)

In [106]:
lr.fit(T_train , S_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='liblinear', tol=0.0001, verbose=0,
                   warm_start=False)

In [107]:
pred = lr.predict(T_test)

In [110]:
lr.score(T_test , S_test)

0.7904191616766467

In [111]:
lr = LogisticRegression(solver = 'liblinear')
lr.fit(X_train , Y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='liblinear', tol=0.0001, verbose=0,
                   warm_start=False)

In [112]:
Y_pred = lr.predict(X_test)